#========================================================================
#	Makefile for bootsala.x
#			Written by Igarashi
#========================================================================
#========================================================================
#	再アセンブルには、has（has060）、hlkが必要です。
#	doscall.macおよびiocscall.macは、LIBC付属のものを使用しています。
#========================================================================
.PHONY: all inc_a inc_b

all: bootsala.x

%.x: %.o
	hlk $< -o $@

bootsala.o: bootsala.s pattbl_a.inc pattbl_b.inc
	has060 $< -o $@

#========================================================================
#	pattbl?.incを作り直す場合は以下のようにしてください。
#
#		pattbl_a.inc	→	make inc_a
#		pattbl_b.inc	→	make inc_b
#
#	この場合、FC、MicroEmacs、dis、MUSHおよび
#	大容量メモリと大容量ディスクが必要です。なお、MicroEmacsは
#	makedump.batを実行して生成されるemx.xをem.xにリネーム
#	したものを使用してください（他人のでは動かないかも）。
#
#	*.incファイル１つにつき、無改造X68030で３分以上の時間がかかりま
#	す。気長に待ちましょう。
#========================================================================
#========================================================================
#	マクロSALAX_?にはSALA.Xのフルパス名を指定します。各自の環境に書
#	き換えてください。
#
#		ex.) SALAX_A = c:/sala/sala.x
#========================================================================
SALAX_A = ver_a/SALA.X
SALAX_B = ver_b/SALA.X
#========================================================================
#	pattbl_a.incおよびpattbl_b.incを作成します。
#========================================================================
inc_a:
	mkinc $(SALAX_A) sala_a.lab cvsala.rc pattbl_a.inc
inc_b:
	mkinc $(SALAX_B) sala_b.lab cvsala.rc pattbl_b.inc

